; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph2 - mode
	thermograph3 - mode
	image0 - mode
	thermograph1 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Planet4 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 167)
	(= (data Planet4 thermograph2) 292)
	(= (data Planet5 thermograph2) 176)
	(= (data Star6 thermograph2) 291)
	(= (data Star7 thermograph2) 105)
	(= (data Planet8 thermograph2) 84)
	(= (data Planet4 thermograph3) 155)
	(= (data Planet5 thermograph3) 277)
	(= (data Star6 thermograph3) 39)
	(= (data Star7 thermograph3) 192)
	(= (data Planet8 thermograph3) 188)
	(= (data Planet4 image0) 32)
	(= (data Planet5 image0) 16)
	(= (data Star6 image0) 36)
	(= (data Star7 image0) 56)
	(= (data Planet8 image0) 147)
	(= (data Planet4 thermograph1) 288)
	(= (data Planet5 thermograph1) 16)
	(= (data Star6 thermograph1) 56)
	(= (data Star7 thermograph1) 20)
	(= (data Planet8 thermograph1) 245)
	(= (slew_time GroundStation2 Star0) 42.65)
	(= (slew_time Star0 GroundStation2) 42.65)
	(= (slew_time GroundStation2 GroundStation1) 27.13)
	(= (slew_time GroundStation1 GroundStation2) 27.13)
	(= (slew_time GroundStation3 Star0) 74.8)
	(= (slew_time Star0 GroundStation3) 74.8)
	(= (slew_time GroundStation3 GroundStation1) 1.597)
	(= (slew_time GroundStation1 GroundStation3) 1.597)
	(= (slew_time GroundStation3 GroundStation2) 16.15)
	(= (slew_time GroundStation2 GroundStation3) 16.15)
	(= (slew_time GroundStation1 Star0) 56.88)
	(= (slew_time Star0 GroundStation1) 56.88)
	(= (slew_time Planet4 Star0) 52.02)
	(= (slew_time Star0 Planet4) 52.02)
	(= (slew_time Planet4 GroundStation1) 8.155)
	(= (slew_time GroundStation1 Planet4) 8.155)
	(= (slew_time Planet4 GroundStation2) 47.65)
	(= (slew_time GroundStation2 Planet4) 47.65)
	(= (slew_time Planet4 GroundStation3) 23.02)
	(= (slew_time GroundStation3 Planet4) 23.02)
	(= (slew_time Planet5 Star0) 58.19)
	(= (slew_time Star0 Planet5) 58.19)
	(= (slew_time Planet5 GroundStation1) 9.878)
	(= (slew_time GroundStation1 Planet5) 9.878)
	(= (slew_time Planet5 GroundStation2) 8.626)
	(= (slew_time GroundStation2 Planet5) 8.626)
	(= (slew_time Planet5 GroundStation3) 8.076)
	(= (slew_time GroundStation3 Planet5) 8.076)
	(= (slew_time Planet5 Planet4) 62.21)
	(= (slew_time Planet4 Planet5) 62.21)
	(= (slew_time Star6 Star0) 89.06)
	(= (slew_time Star0 Star6) 89.06)
	(= (slew_time Star6 GroundStation1) 48.19)
	(= (slew_time GroundStation1 Star6) 48.19)
	(= (slew_time Star6 GroundStation2) 24.55)
	(= (slew_time GroundStation2 Star6) 24.55)
	(= (slew_time Star6 GroundStation3) 6.084)
	(= (slew_time GroundStation3 Star6) 6.084)
	(= (slew_time Star6 Planet4) 15.04)
	(= (slew_time Planet4 Star6) 15.04)
	(= (slew_time Star6 Planet5) 33.02)
	(= (slew_time Planet5 Star6) 33.02)
	(= (slew_time Star7 Star0) 31.89)
	(= (slew_time Star0 Star7) 31.89)
	(= (slew_time Star7 GroundStation1) 0.08344)
	(= (slew_time GroundStation1 Star7) 0.08344)
	(= (slew_time Star7 GroundStation2) 12.23)
	(= (slew_time GroundStation2 Star7) 12.23)
	(= (slew_time Star7 GroundStation3) 83.9)
	(= (slew_time GroundStation3 Star7) 83.9)
	(= (slew_time Star7 Planet4) 45.56)
	(= (slew_time Planet4 Star7) 45.56)
	(= (slew_time Star7 Planet5) 3.932)
	(= (slew_time Planet5 Star7) 3.932)
	(= (slew_time Star7 Star6) 31.55)
	(= (slew_time Star6 Star7) 31.55)
	(= (slew_time Planet8 Star0) 32.21)
	(= (slew_time Star0 Planet8) 32.21)
	(= (slew_time Planet8 GroundStation1) 12.04)
	(= (slew_time GroundStation1 Planet8) 12.04)
	(= (slew_time Planet8 GroundStation2) 45.04)
	(= (slew_time GroundStation2 Planet8) 45.04)
	(= (slew_time Planet8 GroundStation3) 67.12)
	(= (slew_time GroundStation3 Planet8) 67.12)
	(= (slew_time Planet8 Planet4) 66.41)
	(= (slew_time Planet4 Planet8) 66.41)
	(= (slew_time Planet8 Planet5) 15.24)
	(= (slew_time Planet5 Planet8) 15.24)
	(= (slew_time Planet8 Star6) 48.71)
	(= (slew_time Star6 Planet8) 48.71)
	(= (slew_time Planet8 Star7) 65.32)
	(= (slew_time Star7 Planet8) 65.32)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Planet4 image0)
	(have_image Star6 image0)
	(have_image Planet8 image0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 groundstation1 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 167 to 118.81, (fuel-used) from 0 to 48.19
   goals met: 0 of 3
2. (turn_to satellite0 planet8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet8)
   changed: (fuel satellite0) from 118.81 to 106.77, (fuel-used) from 48.19 to 60.23
   goals met: 0 of 3
3. (turn_to satellite0 groundstation1 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 106.77 to 94.73, (fuel-used) from 60.23 to 72.27
   goals met: 0 of 3
4. (turn_to satellite0 groundstation3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 94.73 to 93.133, (fuel-used) from 72.27 to 73.867
   goals met: 0 of 3
5. (turn_to satellite0 groundstation1 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 93.133 to 91.536, (fuel-used) from 73.867 to 75.464
   goals met: 0 of 3
6. (turn_to satellite0 groundstation3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 91.536 to 89.939, (fuel-used) from 75.464 to 77.061
   goals met: 0 of 3
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
8. (turn_to satellite0 groundstation1 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 89.939 to 88.342, (fuel-used) from 77.061 to 78.658
   goals met: 0 of 3
9. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 3
10. (turn_to satellite0 planet8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet8)
   changed: (fuel satellite0) from 88.342 to 76.302, (fuel-used) from 78.658 to 90.698
   goals met: 0 of 3
11. (take_image satellite0 planet8 instrument0 image0)
   added: (have_image planet8 image0)
   changed: (data_capacity satellite0) from 1000 to 853, (data-stored) from 0 to 147
   goals met: 1 of 3
12. (turn_to satellite0 star6 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 76.302 to 27.592, (fuel-used) from 90.698 to 139.408
   goals met: 1 of 3
13. (take_image satellite0 star6 instrument0 image0)
   added: (have_image star6 image0)
   changed: (data_capacity satellite0) from 853 to 817, (data-stored) from 147 to 183
   goals met: 2 of 3
14. (turn_to satellite0 planet4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 27.592 to 12.552, (fuel-used) from 139.408 to 154.448
   goals met: 2 of 3
15. (take_image satellite0 planet4 instrument0 image0)
   added: (have_image planet4 image0)
   changed: (data_capacity satellite0) from 817 to 785, (data-stored) from 183 to 215
   goals met: 3 of 3
